requests/updateScheduleRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:por="http://www.hostco.ru/portal"
                  xmlns:typ="http://www.hostco.ru/types"
                  xmlns:typ1="http://www.hostco.ru/portal/types">
    <soapenv:Header/>
    <soapenv:Body>
        <por:updateScheduleRequest>
            <typ:scheduleDate>2019-04-01</typ:scheduleDate>
            <typ:muCode>998</typ:muCode>
            <typ:deptCode>50</typ:deptCode>
            <typ:roomNumber>1</typ:roomNumber>
            <typ:docCode>16067057157</typ:docCode>
            <typ:specCode>27</typ:specCode>
            <typ:positionCode>74</typ:positionCode>
            <typ:docSNILS>16067057157</typ:docSNILS>
            <typ1:SlotElement>
                <typ:timeInterval>
                    <typ:timeStart>09:00:00.000Z</typ:timeStart>
                    <typ:timeFinish>09:15:00.000Z</typ:timeFinish>
                </typ:timeInterval>
                <typ:slotType>2</typ:slotType>
                <typ:slotInfo>
                    <typ:GUID>50_1</typ:GUID>
                    <typ:SlotState>1</typ:SlotState>
                </typ:slotInfo>
            </typ1:SlotElement>
            <typ1:update>false</typ1:update>
        </por:updateScheduleRequest>
    </soapenv:Body>
</soapenv:Envelope>